БухЭксп/InformationRegisters/CW_СтатьиЗатратНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_СтатьиЗатратНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_СтатьяЗатрат</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_ПорядокОтраженияДоходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ПорядокОтраженияДоходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Перевыставление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобственнаяУслуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеревыставлениеПоСтавкам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеДоходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_ПорядокОтраженияЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ПорядокОтраженияЗатрат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Перевыставление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Затраты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеревыставлениеПоСтавкам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/CommonForms/CW_ФормаВыбораНоменклатуры/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РазрешитьПолучениеКоличестваУслугИзпараметраГрузоперевозки 	= ПолучитьФункциональнуюОпцию("CW_РазрешитьПолучениеКоличестваУслугИзпараметраГрузоперевозки");
	
	ПараметрыФункциональныхОпций = Новый Структура("CW_Пользователь", CW_Настройки.Пользователь());
	УстановитьПараметрыФункциональныхОпцийФормы(ПараметрыФункциональныхОпций);
	
	Если РазрешитьПолучениеКоличестваУслугИзпараметраГрузоперевозки Тогда
		Элементы.ПорядокПолученияКоличества.СписокВыбора.Вставить(0,0, "из параметра грузопереовзки");
	Иначе
		ПорядокПолученияКоличества = 1;
	КонецЕсли;
	
	ТипДокумента = Параметры.ТипДокумента;
	
	Если Параметры.Свойство("Договор") Тогда 
		Договор = Параметры.Договор;
	КонецЕсли;
	
	//Подсистема.УчетПриложенийДоговоров
	Если Параметры.Свойство("ПриложениеКДоговору") Тогда 
		ПриложениеКДоговору = Параметры.ПриложениеКДоговору;
	КонецЕсли;
	//Подсистема.УчетПриложенийДоговоров
	
	Параметры.Свойство("ДатаДокумента",ДатаДокумента);
	
	КаталогУслуг = Константы.CW_КаталогУслуг.Получить();
	
	// настройки пользователя
	структураНастройкиПользователя = CW_Настройки.ПолучитьНастройкиПользователя();    
	ПодставлятьСтавку         = структураНастройкиПользователя.ПодставлятьСтавкуНДС;
	ПодразделениеПользователя = структураНастройкиПользователя.ПодразделениеПользователя;
	
	мПорядокОтражения = Новый Массив;
	мПорядокОтражения.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.Перевыставление"));
	мПорядокОтражения.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Затраты"));
	
	Если ТипДокумента = "CW_РасходыПоГрузоперевозке" Тогда
		ПорядокОтраженияИмя = "ПорядокОтраженияРасходов";
	ИначеЕсли ТипДокумента = "CW_ДоходыПоГрузоперевозке" Тогда
		ПорядокОтраженияИмя = "ПорядокОтраженияДоходов";
	КонецЕсли; 
	
	// договор и его параметры
	Если ЗначениеЗаполнено(Договор) Тогда
		
		СтруктураПараметров = CW_Настройки.ПустаяСтруктураПолученияПараметровДоговора();
		СтруктураПараметров.Дата 	= ТекущаяДата();
		СтруктураПараметров.Договор = Договор;
		СтруктураПараметров.ПриложениеКДоговору = ПриложениеКДоговору;
		
		ПараметрыДоговора = CW_Настройки.ПолучитьПараметрыДоговора(СтруктураПараметров, "ОсновнойПорядокОтраженияРасходов;ОсновнойПорядокОтраженияДоходов");
		
		ОсновнойПорядокОтраженияРасходов	= ПараметрыДоговора.ОсновнойПорядокОтраженияРасходов;
		ОсновнойПорядокОтраженияДоходов  	= ПараметрыДоговора.ОсновнойПорядокОтраженияДоходов;

		Организация 						= Договор.Организация;
		
		//Ограничение списка услуг 
		ЕстьОграниченияНоменклатурыПоДоговору	= Договор.ОграничиватьНоменклатуру и ПолучитьФункциональнуюОпцию("CW_ОграничиватьУслугиПоДоговорам");
		ЕстьОграниченияНоменклатуры 			= ЕстьОграниченияНоменклатурыПоДоговору;
		
		Если ЕстьОграниченияНоменклатурыПоДоговору	Тогда
			АдресУслугПоДоговору	= _УФС.ОбновитьСписокУслугПоДоговору(ДатаДокумента, Договор, ЭтаФорма);
		КонецЕсли;
		
		НеОграничиватьУслугиПоПеревыставлению 	= Константы.CW_НеОграничиватьСписокУслугПриПеревыставленииЗатрат.Получить();   
		
		Если ЕстьОграниченияНоменклатуры и НеОграничиватьУслугиПоПеревыставлению Тогда
			Если ТипДокумента = "CW_РасходыПоГрузоперевозке" Тогда
				ЕстьОграниченияНоменклатуры = ОсновнойПорядокОтраженияРасходов <> ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Перевыставление");
			ИначеЕсли ТипДокумента = "CW_ДоходыПоГрузоперевозке" Тогда
				ЕстьОграниченияНоменклатуры = ОсновнойПорядокОтраженияДоходов <> ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.Перевыставление");
			КонецЕсли; 
		КонецЕсли;
		
		Если ЕстьОграниченияНоменклатуры Тогда
			УстанавливатьЦенуВЗависимостиОтГруза  	= ПолучитьФункциональнуюОпцию("CW_УстанавливатьЦенуВЗависимостиОтГруза");  
		КонецЕсли;
		
		СтруктураДанных = новый Структура;
		СтруктураДанных.Вставить("АдресУслугПоДоговору"			, АдресУслугПоДоговору);
		СтруктураДанных.Вставить("ЭлементФормы"					, Элементы.Номенклатура);
		СтруктураДанных.Вставить("ЕстьОграниченияПоСпискуУслуг"	, ЕстьОграниченияНоменклатуры);
		
		_УФС.УстановитьСписокУслуг(СтруктураДанных);
		//Ограничение списка услуг
	
	КонецЕсли;
 	
	Если ТипДокумента = "CW_РасходыПоГрузоперевозке" Тогда
		ИмяНастройки = "Расходы";
		РасходнаяСтатья = Истина;
		Элементы.ПорядокОтраженияРасходов.Видимость = Истина;
		Элементы.ПорядокОтраженияДоходов.Видимость = Ложь;
		ПорядокОтражения = ОсновнойПорядокОтраженияРасходов;
	ИначеЕсли ТипДокумента = "CW_ДоходыПоГрузоперевозке" Тогда
		ИмяНастройки = "Доходы";
		ДоходнаяСтатья = Истина;
		Элементы.ПорядокОтраженияРасходов.Видимость = Ложь;
		Элементы.ПорядокОтраженияДоходов.Видимость = Истина;
		ПорядокОтражения = ОсновнойПорядокОтраженияДоходов;
	КонецЕсли;  
	

	
	// настройки уч.политики организации
	Если ЗначениеЗаполнено(Организация) Тогда
		ПараметрыУчетнойПолитики = CW_Настройки.ПараметрыУчетнойПолитики(ТекущаяДата(), Организация);
		ОсновнаяСтатьяЗатрат   = ПараметрыУчетнойПолитики.ОсновнаяСтатьяЗатрат;
		ОсновнойСпособУчетаНДС = ПараметрыУчетнойПолитики.ОсновнойСпособУчетаНДС;
	КонецЕсли;
	
	Если Параметры.Свойство("РаздельныйУчетВходящегоНДС") Тогда 
		РаздельныйУчетВходящегоНДС = Параметры.РаздельныйУчетВходящегоНДС;
	Иначе 
		РаздельныйУчетВходящегоНДС = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("ГруппировкаЗатратПоПодразделениям") Тогда 
		ГруппировкаЗатратПоПодразделениям = Параметры.ГруппировкаЗатратПоПодразделениям;
	Иначе 
		ГруппировкаЗатратПоПодразделениям = Ложь;
	КонецЕсли;

	Элементы.Подразделение.Видимость = Ложь;
	
	Валюта = Параметры.Валюта;
	
	СтавкаНДСПриРеализации = УчетНДСКлиентСервер.СтавкаНДСПриРеализации(ДатаДокумента, Организация);
	
	// читаем параметры из сеансовой настройки
	Настройки = _УФС.ЗагрузитьСеансовыеНастройки(ЭтаФорма,"Сеансовая_"+ИмяНастройки);
	ПоУмолчанию = Истина;
	Если Настройки <> Неопределено Тогда
		Попытка
			// читаем
			СеансовыйПорядокОтраженияДоходов 	= Настройки.ПорядокОтраженияДоходов;
			СеансовыйПорядокОтраженияРасходов 	= Настройки.ПорядокОтраженияРасходов;
			// --- 
			ВариантПредставления 		= Настройки.ВариантПредставления;
			Представление 				= Настройки.Представление;
			ВариантОпределенияСуммы 	= Настройки.ВариантОпределенияСуммы;
			СуммаВключаетНДС 			= Настройки.СуммаВключаетНДС;
			ВариантРаспределения 		= Настройки.ВариантРаспределения;
			ПараметрРаспределения 		= Настройки.ПараметрРаспределения;
			
			Если РазрешитьПолучениеКоличестваУслугИзпараметраГрузоперевозки Тогда
				ПорядокПолученияКоличества  = Настройки.ПорядокПолученияКоличества;
			КонецЕсли;
			
			Настройки.Свойство("РазделитьКоличествоУслугНаКоличествоГрузоперевозок",РазделитьКоличествоУслугНаКоличествоГрузоперевозок);
			Настройки.Свойство("РаспределитьКоличествоПророрциональноПараметру",РаспределитьКоличествоПророрциональноПараметру);
			
			// ---------------------------------------------------------------------------- 
			ПоУмолчанию = Ложь;
			
		Исключение
			//ОписаниеОшибки()
		КонецПопытки; 
		
	КонецЕсли;
	
	Если ПоУмолчанию Тогда
		
		ПорядокОтраженияРасходов = Перечисления.CW_ПорядокОтраженияЗатрат.Затраты;
		ПорядокОтраженияДоходов = Перечисления.CW_ПорядокОтраженияДоходов.СобственнаяУслуга;
		// --- 
		ВариантПредставления 	= 0;
		СуммаВключаетНДС 		= Истина;
		ПараметрРаспределения 	= ПланыВидовХарактеристик.CW_ПараметрыГрузоперевозок.ПустаяСсылка();
		
		ВариантРаспределения 	= 1;

		ВариантОпределенияСуммы = 1;
		Если ЕстьОграниченияНоменклатуры Тогда
			ВариантОпределенияСуммы = 0;
		КонецЕсли;
		
	КонецЕсли; 
	

	
	Если (ЗначениеЗаполнено(ПорядокОтражения)) Тогда
		Если (ТипДокумента = "CW_РасходыПоГрузоперевозке") Тогда
			ПорядокОтраженияРасходов = ПорядокОтражения;
		Иначе
			ПорядокОтраженияДоходов = ПорядокОтражения;
		КонецЕсли; 
		
	Иначе
		Если (ЗначениеЗаполнено(СеансовыйПорядокОтраженияДоходов)) Тогда
			ПорядокОтраженияДоходов = СеансовыйПорядокОтраженияДоходов;
		Иначе
			ПорядокОтраженияДоходов=Перечисления.CW_ПорядокОтраженияДоходов.СобственнаяУслуга;
		КонецЕсли; 
		Если (ЗначениеЗаполнено(СеансовыйПорядокОтраженияРасходов)) Тогда
			ПорядокОтраженияРасходов = СеансовыйПорядокОтраженияРасходов;
		Иначе
			ПорядокОтраженияРасходов=Перечисления.CW_ПорядокОтраженияЗатрат.Затраты;
		КонецЕсли; 
		
	КонецЕсли; 
	
	_ПредставлениеПараметраРаспределения();
	
	// --- 
	
	Количество = 1;
	
	// --- 
	ПеревыставлениеПоСтавкам = ПолучитьФункциональнуюОпцию("CW_ИспользованиеСхемыПеревыставленияПоСтавкам");
	
	Элементы.СтавкаНДС.Доступность = CW_ПраваДоступа.ПравоДоступно("РедактированиеСтавкиНДС");
	
	Элементы.ПорядокОтраженияДоходов.РежимВыбораИзСписка=Истина;
	Элементы.ПорядокОтраженияДоходов.ОтображениеКнопкиВыбора = ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
	Элементы.ПорядокОтраженияДоходов.ИсторияВыбораПриВводе=ИсторияВыбораПриВводе.НеИспользовать;
	// --- 
	Элементы.ПорядокОтраженияДоходов.СписокВыбора.Очистить();
	Элементы.ПорядокОтраженияДоходов.СписокВыбора.Добавить(Перечисления.CW_ПорядокОтраженияДоходов.СобственнаяУслуга);
	Элементы.ПорядокОтраженияДоходов.СписокВыбора.Добавить(Перечисления.CW_ПорядокОтраженияДоходов.Перевыставление);
	Элементы.ПорядокОтраженияДоходов.СписокВыбора.Добавить(Перечисления.CW_ПорядокОтраженияДоходов.ПрочиеДоходы);
	// --- 
	Если (ПеревыставлениеПоСтавкам) Тогда
		Элементы.ПорядокОтраженияДоходов.СписокВыбора.Добавить(Перечисления.CW_ПорядокОтраженияДоходов.ПеревыставлениеПоСтавкам);
	КонецЕсли; 
	
	// --- 
	Элементы.ПорядокОтраженияРасходов.РежимВыбораИзСписка=Истина;
	Элементы.ПорядокОтраженияРасходов.ОтображениеКнопкиВыбора = ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
	Элементы.ПорядокОтраженияРасходов.ИсторияВыбораПриВводе=ИсторияВыбораПриВводе.НеИспользовать;
	// --- 
	Элементы.ПорядокОтраженияРасходов.СписокВыбора.Очистить();
	Элементы.ПорядокОтраженияРасходов.СписокВыбора.Добавить(Перечисления.CW_ПорядокОтраженияЗатрат.Затраты);
	Элементы.ПорядокОтраженияРасходов.СписокВыбора.Добавить(Перечисления.CW_ПорядокОтраженияЗатрат.Перевыставление);
	Элементы.ПорядокОтраженияРасходов.СписокВыбора.Добавить(Перечисления.CW_ПорядокОтраженияЗатрат.ПрочиеРасходы);
	// --- 
	Если (ПеревыставлениеПоСтавкам) Тогда
		Элементы.ПорядокОтраженияРасходов.СписокВыбора.Добавить(Перечисления.CW_ПорядокОтраженияЗатрат.ПеревыставлениеПоСтавкам);
	КонецЕсли; 
	// --- 
	
	//Элементы.ГруппаПараметрыРасходов.Видимость = (РасходнаяСтатья);
	Элементы.СпособУчетаНДС.Видимость = Ложь;
	Если (РасходнаяСтатья) Тогда
		Элементы.СпособУчетаНДС.Доступность = (РаздельныйУчетВходящегоНДС И CW_ПраваДоступа.ПравоДоступно("РедактированиеСпособаУчетаНДС"));
		Если (Элементы.СпособУчетаНДС.Видимость) Тогда
			СпособУчетаНДС = ОсновнойСпособУчетаНДС;
		КонецЕсли; 
	КонецЕсли; 
	
	Элементы.Подразделение.Видимость = Ложь;
	Если (РасходнаяСтатья) Тогда
		// если по организации ведется учет затрат по подразделениям
		Если ГруппировкаЗатратПоПодразделениям Тогда 
			Если ЗначениеЗаполнено(ПодразделениеПользователя) Тогда 
				Подразделение = ПодразделениеПользователя;
			Иначе 
				Подразделение = ПараметрыУчетнойПолитики.ОсновноеПодразделение;
			КонецЕсли;
			Элементы.Подразделение.Видимость = Истина;
		КонецЕсли;
	КонецЕсли;
	
	// --- 
	
	МассивИсключаемыхРеквизитов = Новый Массив;
	МассивИсключаемыхРеквизитов.Добавить("Номенклатура");
	_УФС.ОтключитьИсториюВыбораЭлементовФормы(ЭтаФорма,МассивИсключаемыхРеквизитов);
	_УправлениеЭлементамиФормами();
	
	ЗаполнитьПараметрыФормулы();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыФормулы()

	ШаблонФормулы = "[ЦенаУслуги] [Валюта] х [Количество] [ЕдиницаИзмерения] = [Сумма] [Валюта]";
	
	ВалютаДоговора = Строка(Договор.ВалютаДоговора);
	
	ЦенаУслуги 			= 0;
	ЕдиницаИзмерения	= "";
	тКоличество 		= 1;
	
	ЕстьОграниченияНоменклатуры = ПолучитьНаличиеОграниченийПоНоменклатуре();
	
	Если ЕстьОграниченияНоменклатуры и ЗначениеЗаполнено(Номенклатура) Тогда
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("АдресУслугПоДоговору"						, АдресУслугПоДоговору);
		СтруктураПараметров.Вставить("УстанавливатьЦенуВЗависимостиОтГруза"		, Ложь);
		СтруктураПараметров.Вставить("УстанавливатьЦенуВЗависимостиОтКлиента"	, Ложь);
		
		СтруктураПараметров.Вставить("Номенклатура"								, Номенклатура);
			
		УслугаДоговора = _УФС.ПолучитьУслугуДоговораПоПараметрам(СтруктураПараметров);		
		
		Если УслугаДоговора <> Неопределено Тогда 				   
			ЦенаУслуги		= УслугаДоговора.ЦенаБезНДС;
			
			Если ТипЗнч(УслугаДоговора.ПорядокОтражения) = Тип("ПеречислениеСсылка.CW_ПорядокОтраженияДоходов") Тогда
				ПорядокОтраженияДоходов = УслугаДоговора.ПорядокОтражения;
			ИначеЕсли ТипЗнч(УслугаДоговора.ПорядокОтражения) = Тип("ПеречислениеСсылка.CW_ПорядокОтраженияЗатрат") Тогда
				ПорядокОтраженияРасходов = УслугаДоговора.ПорядокОтражения;
			КонецЕсли;				
				
		КонецЕсли; 
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		ЕдиницаИзмерения = Строка(Номенклатура.ЕдиницаИзмерения);	
	КонецЕсли;
	
	Если ПорядокПолученияКоличества = 1 тогда
		тКоличество = Количество;
	Конецесли;
	
	Сумма =  ЦенаУслуги * тКоличество;
	
	ПараметрыФормулы = Новый Структура;
	ПараметрыФормулы.Вставить("Валюта"			, ВалютаДоговора);
	ПараметрыФормулы.Вставить("ЦенаУслуги"		, ?(ЦенаУслуги=0, "{Цена за услугу}", Формат(ЦенаУслуги,"ЧДЦ=2"))+?(УстанавливатьЦенуВЗависимостиОтГруза,"*",""));
	ПараметрыФормулы.Вставить("ЕдиницаИзмерения", ?(ЗначениеЗаполнено(ЕдиницаИзмерения),"("+ЕдиницаИзмерения+")", ""));
	ПараметрыФормулы.Вставить("Количество"		, Формат(тКоличество,"ЧДЦ=3"));
	ПараметрыФормулы.Вставить("Сумма"		    , Формат(Сумма,"ЧДЦ=2"));
	
	
	Для Каждого ПараметрФормулы  из ПараметрыФормулы Цикл
		ШаблонФормулы = СтрЗаменить(ШаблонФормулы, "["+ПараметрФормулы.Ключ+"]", ПараметрФормулы.Значение);
	КонецЦикла;
	
	Элементы.ФормулаПолученияСуммы.Заголовок =  ШаблонФормулы;
	
	
КонецПроцедуры
// ---------------------------------------------------------------------------- 

&НаСервере
Процедура _УправлениеЭлементамиФормами()
	// --- 
	
	Элементы.ГруппаПроизвольноеПредставление.Видимость = (ВариантПредставления = 1);
	// --- 
	Элементы.ГруппаФиксированнаяСумма.Видимость = (ВариантОпределенияСуммы = 1);
	// --- 
	Элементы.ГруппаРаспределениеСуммы.Видимость = (ВариантРаспределения = 2);
	// --- 
	Элементы.РаспределитьКоличествоПророрциональноПараметру.Видимость = (ВариантРаспределения = 2);
	//Элементы.ВариантРаспределения.Доступность = (НЕ ВариантОпределенияСуммы = 0);
	//Элементы.РазделитьКоличествоУслугНаКоличествоГрузоперевозок.Видимость = (ВариантРаспределения = 0);
	
	Элементы.ГруппаПараметрыВыручки.Видимость = (ВариантРаспределения = 3);
	Элементы.УчитыватьСуммыНеактированныхСчетов.Видимость = (ОпределениеВыручки = 1);
	
	Элементы.СпособУчетаНДС.Видимость = Элементы.СпособУчетаНДС.Доступность И РасходнаяСтатья И ПорядокОтраженияРасходов = Перечисления.CW_ПорядокОтраженияЗатрат.Затраты;
	
	Элементы.Количество.Видимость 						= ПорядокПолученияКоличества = 1;
	Элементы.ГруппаРаспределениеКоличества.Видимость 	= ПорядокПолученияКоличества = 1;
	
	ЕстьОграниченияНоменклатуры = ПолучитьНаличиеОграниченийПоНоменклатуре();
	Если ЕстьОграниченияНоменклатуры Тогда
		Элементы.ГруппаРаспределение.Видимость = ВариантОпределенияСуммы <> 0;
	КонецЕсли;    
	
	Элементы.ГруппаРаспределение.Доступность = ВариантОпределенияСуммы <> 2;	
	
	
	Элементы.Группа4.Видимость = ВариантОпределенияСуммы = 2;
	
	//Элементы.ФормулаПолученияСуммы.Видимость = ВариантОпределенияСуммы = 0;
	
	//Элементы.КомментарийКФормуле.Видимость = УстанавливатьЦенуВЗависимостиОтГруза;
	
КонецПроцедуры
 
&НаСервере
Процедура _ПредставлениеПараметраРаспределения()
	// --- 
	
	Если ПараметрРаспределения.Пустая() Тогда
		
		ПредставлениеПараметраРаспределения = "< ... >";
		
	Иначе
		
		ПредставлениеПараметраРаспределения = Строка(ПараметрРаспределения);
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
 

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура НоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	ЕстьОграниченияНоменклатуры = ПолучитьНаличиеОграниченийПоНоменклатуре();
	
	Если ЕстьОграниченияНоменклатуры И Элемент.СписокВыбора.Количество() = 0 Тогда
		СтандартнаяОбработка = Ложь;
		
		Сообщение = новый СообщениеПользователю;
		Сообщение.Текст   		= "Не определен список услуг по договору!";
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)

	ЕстьОграниченияНоменклатуры = ПолучитьНаличиеОграниченийПоНоменклатуре();
	
	Если ПодставлятьСтавку = Неопределено Тогда
		ПодставлятьСтавку = Ложь;
	КонецЕсли;   
	
	ПН = _ПараметрыНоменклатуры(Номенклатура, ЕстьОграниченияНоменклатуры, АдресУслугПоДоговору, ТипДокумента, Организация, Договор, ДатаДокумента, ПодставлятьСтавку);
	
	_УстановитьСтатьюЗатрат();
	
	Если ЗначениеЗаполнено(Номенклатура) И Элементы.ПорядокОтраженияРасходов.Видимость  Тогда
		СтруктураПараметров = ПодготовитьСтруктуруПараметровПолученияСпособаУчетаНДС();
		СпособУчетаНДС 		= CW_Финансы.ПолучитьСпособУчетаНДС(СтруктураПараметров);
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ПН.ПорядокОтражения) Тогда
		Если Типзнч(ПН.ПорядокОтражения) = Тип("ПеречислениеСсылка.CW_ПорядокОтраженияДоходов") Тогда
			ПорядокОтраженияДоходов = ПН.ПорядокОтражения;
		Иначе
			ПорядокОтраженияРасходов = ПН.ПорядокОтражения;
		КонецЕсли;
	КонецЕсли;
	
	Представление = ПН.Представление;
	
	// ставка НДС подставляется в зависимости от настройки пользователя
	СтавкаНДС = ПН.СтавкаНДС;                  
	
	//Дополним параметры формулы
	ЗаполнитьПараметрыФормулы();
	
КонецПроцедуры

&НаСервере
Процедура _УстановитьСтатьюЗатрат()
	// --- 
	
	// пробуем найти в регистре
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_СтатьиЗатратНоменклатуры.СтатьяЗатрат
	|ИЗ
	|	РегистрСведений.CW_СтатьиЗатратНоменклатуры КАК CW_СтатьиЗатратНоменклатуры
	|ГДЕ
	|	CW_СтатьиЗатратНоменклатуры.Номенклатура = &Номенклатура";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	ТЗ = Запрос.Выполнить().Выгрузить();
	СтрокаСтатьяЗатрат = _сф.к_ПервыйЭлемент(ТЗ);
	Если (СтрокаСтатьяЗатрат <> Неопределено) Тогда
		
		СтатьяЗатрат = СтрокаСтатьяЗатрат.СтатьяЗатрат;
		
	Иначе
		
		СтатьяЗатрат = ОсновнаяСтатьяЗатрат;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
 

&НаСервереБезКонтекста
Функция _ПараметрыНоменклатуры(Номенклатура, ЕстьОграниченияНоменклатуры, АдресУслугПоДоговору, ТипДокумента, Организация, Договор, ДатаДокумента, ПодставлятьСтавку)
	
	ПН = Новый Структура("СтатьяЗатрат,Представление,СтавкаНДС,ПорядокОтражения");
	ПН.СтатьяЗатрат 	= Номенклатура.СтатьяЗатрат;
	ПН.Представление 	= Номенклатура.НаименованиеПолное; 
	
	ПараметрыСтавкиНДС = Новый Структура;
	ПараметрыСтавкиНДС.Вставить("Дата", 		ДатаДокумента);
	ПараметрыСтавкиНДС.Вставить("Организация", 	Организация);
	ПараметрыСтавкиНДС.Вставить("Номенклатура", Номенклатура); 
	ПараметрыСтавкиНДС.Вставить("Договор", 		Договор); 
	ПараметрыСтавкиНДС.Вставить("ПодставлятьСтавкуНДС", ПодставлятьСтавку); 

	Если ТипДокумента = "CW_ДоходыПоГрузоперевозке" Тогда
		ПараметрыСтавкиНДС.Вставить("ТипДвижения", "ДОХОДЫ");
	Иначе
		ПараметрыСтавкиНДС.Вставить("ТипДвижения", "РАСХОДЫ");
	КонецЕсли;   
	
	ПН.СтавкаНДС = CW_Документы.ПолучитьСтавкуНДС(ПараметрыСтавкиНДС);
	
	Если ЕстьОграниченияНоменклатуры Тогда
		Если ЭтоАдресВременногоХранилища(АдресУслугПоДоговору) Тогда
			
			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("АдресУслугПоДоговору"						, АдресУслугПоДоговору);
			СтруктураПараметров.Вставить("УстанавливатьЦенуВЗависимостиОтГруза"		, Ложь);
			СтруктураПараметров.Вставить("УстанавливатьЦенуВЗависимостиОтКлиента"	, Ложь);
			
			СтруктураПараметров.Вставить("Номенклатура"								, Номенклатура);
			
			УслугаДоговора = _УФС.ПолучитьУслугуДоговораПоПараметрам(СтруктураПараметров);
			
			Если УслугаДоговора <> Неопределено Тогда 				   
				ПН.СтавкаНДС			= УслугаДоговора.СтавкаНДС;
				ПН.ПорядокОтражения		= УслугаДоговора.ПорядокОтражения;
			КонецЕсли; 
		КонецЕсли;		
	КонецЕсли;
	
	Возврат(ПН);

КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура КомандаЗаполнить(Команда)
	
	Если (ЭтаФорма.ТекущийЭлемент=Элементы.Всего И Всего=0) Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.СуммаВключаетНДС;
	КонецЕсли; 
	
	// проверяем заполнение  
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;	
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Номенклатура",			Номенклатура);
	СтруктураПараметров.Вставить("СтатьяЗатрат",			СтатьяЗатрат);
	СтруктураПараметров.Вставить("ВариантПредставления",	ВариантПредставления);
	СтруктураПараметров.Вставить("Представление",			Представление);
	СтруктураПараметров.Вставить("Количество",				Количество);
	СтруктураПараметров.Вставить("СтавкаНДС",				СтавкаНДС);
	СтруктураПараметров.Вставить("ВариантОпределенияСуммы",	ВариантОпределенияСуммы);
	СтруктураПараметров.Вставить("Всего",					Всего);
	СтруктураПараметров.Вставить("СуммаВключаетНДС",		СуммаВключаетНДС);  
	СтруктураПараметров.Вставить("Цена",					Цена);
	СтруктураПараметров.Вставить("ЦенаВключаетНДС",			ЦенаВключаетНДС);  
	
	Если РасходнаяСтатья Тогда
		СтруктураПараметров.Вставить("ПорядокОтраженияРасходов",	ПорядокОтраженияРасходов);	
		СтруктураПараметров.Вставить("СпособУчетаНДС",				СпособУчетаНДС);
		СтруктураПараметров.Вставить("Подразделение", 				Подразделение);
		СтруктураПараметров.Вставить("ОпределениеВыручки",			ОпределениеВыручки);
		СтруктураПараметров.Вставить("УчитыватьСуммыНеактированныхСчетов",	УчитыватьСуммыНеактированныхСчетов);
	КонецЕсли; 
	
	Если ДоходнаяСтатья Тогда
		СтруктураПараметров.Вставить("ПорядокОтраженияДоходов",	ПорядокОтраженияДоходов);	
	КонецЕсли; 
	
	СтруктураПараметров.Вставить("ВариантРаспределения",	ВариантРаспределения);
	СтруктураПараметров.Вставить("ПараметрРаспределения",	ПараметрРаспределения);
	СтруктураПараметров.Вставить("РазделитьКоличествоУслугНаКоличествоГрузоперевозок",	РазделитьКоличествоУслугНаКоличествоГрузоперевозок);
	СтруктураПараметров.Вставить("РаспределитьКоличествоПророрциональноПараметру",		РаспределитьКоличествоПророрциональноПараметру);
	СтруктураПараметров.Вставить("ПорядокПолученияКоличества", ПорядокПолученияКоличества);
	
	ЭтаФорма.Закрыть(СтруктураПараметров);
	
КонецПроцедуры  

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)   
	
	Если РасходнаяСтатья Тогда  
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ПорядокОтраженияДоходов"));
	КонецЕсли;
	Если ДоходнаяСтатья Тогда  
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ПорядокОтраженияРасходов"));
	КонецЕсли;
	
	Если ВариантРаспределения <> 2 Тогда 
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ПараметрРаспределения"));
	КонецЕсли; 
	
КонецПроцедуры



// --- 

&НаКлиенте
Процедура ВариантПредставленияПриИзменении(Элемент)
	
	_УправлениеЭлементамиФормами();
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантОпределенияСуммыПриИзменении(Элемент)
	
	Если ВариантОпределенияСуммы=0 Тогда
		
		Если (ВариантРаспределения = 2) Тогда
			ВариантРаспределения = 1;
			РаспределитьКоличествоПророрциональноПараметру = Ложь;
		КонецЕсли; 
		
	КонецЕсли; 
	
	Если ВариантОпределенияСуммы = 2 Тогда
		ВариантРаспределения = 1;
	КонецЕсли;
	
	// --- 
	_УправлениеЭлементамиФормами();
	ЗаполнитьПараметрыФормулы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантРаспределенияПриИзменении(Элемент)
	
	Если (ВариантОпределенияСуммы = 0 И ВариантРаспределения = 2) Тогда
		ВариантРаспределения = 1;
		_УФК.ВывестиПредупреждение("Распределение по значению параметра для данного режима определения цены недоступно.");
	КонецЕсли; 
	Если (ВариантРаспределения <> 2) Тогда
		РаспределитьКоличествоПророрциональноПараметру = Ложь;
	КонецЕсли; 
	_УправлениеЭлементамиФормами();
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	// --- 
	ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияПредставленияНоменклатуры",ЭтотОбъект, Новый Структура("Элемент",Элемент)); 
	ПФ = Новый Структура("Шаблон,РасходнаяСтатья,ДоходнаяСтатья",Элементы.Представление.ТекстРедактирования,РасходнаяСтатья,ДоходнаяСтатья);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаРедактированияШаблонов",ПФ,,,,,ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияПредставленияНоменклатуры(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если Ответ <> Неопределено Тогда
		
		Представление = Ответ;
		Элементы.Представление.ОбновитьТекстРедактирования();
		
	КонецЕсли;
	
	// --- 
КонецПроцедуры
  

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	_СохранитьСеансовуюНастройку();
	
КонецПроцедуры

&НаСервере
Процедура _СохранитьСеансовуюНастройку()
	// --- 
	
	Настройки = Новый Структура;
	// --- 
	Настройки.Вставить("ПорядокОтраженияДоходов",ПорядокОтраженияДоходов);
	Настройки.Вставить("ПорядокОтраженияРасходов",ПорядокОтраженияРасходов);
	// --- 
	Настройки.Вставить("ВариантПредставления"		, ВариантПредставления);
	Настройки.Вставить("Представление"				, Представление);
	Настройки.Вставить("ВариантОпределенияСуммы"	, ВариантОпределенияСуммы);
	Настройки.Вставить("СуммаВключаетНДС"			, СуммаВключаетНДС);
	Настройки.Вставить("ВариантРаспределения"		, ВариантРаспределения);
	Настройки.Вставить("ПараметрРаспределения"		, ПараметрРаспределения);
	Настройки.Вставить("ПорядокПолученияКоличества"	, ПорядокПолученияКоличества);
	
	Настройки.Вставить("РазделитьКоличествоУслугНаКоличествоГрузоперевозок",РазделитьКоличествоУслугНаКоличествоГрузоперевозок);
	Настройки.Вставить("РаспределитьКоличествоПророрциональноПараметру",РаспределитьКоличествоПророрциональноПараметру);
	// --- 
	_УФС.СохранитьСеансовыеНастройки(ЭтаФорма,"Сеансовая_"+ИмяНастройки,Настройки);
	
	// --- 
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ПредставлениеПараметраРаспределенияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	// --- 
	ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияПараметраРаспределения",ЭтотОбъект); 
	Отбор = Новый Структура("ЭтоЧисло",Истина);
	ПФ = Новый Структура("Отбор",Отбор);
	ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.ФормаВыбора",ПФ,,,,,ПОВ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияПараметраРаспределения(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если Ответ <> Неопределено Тогда
		
		ПараметрРаспределения = Ответ;
		_ПредставлениеПараметраРаспределения();
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаКлиенте
Процедура ПорядокОтраженияРасходовПриИзменении(Элемент)
	
	Если ПорядокОтраженияРасходов.Пустая() Тогда
		ПорядокОтраженияРасходов = ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Затраты");
		Если ЗначениеЗаполнено(Номенклатура) Тогда
			СтруктураПараметров = ПодготовитьСтруктуруПараметровПолученияСпособаУчетаНДС();
			СпособУчетаНДС 		= CW_Финансы.ПолучитьСпособУчетаНДС(СтруктураПараметров);
		КонецЕсли; 
	ИначеЕсли ПорядокОтраженияРасходов = ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Перевыставление") ИЛИ ПорядокОтраженияРасходов = ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.ПеревыставлениеПоСтавкам") Тогда
		СпособУчетаНДС = ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.ПустаяСсылка");
	ИначеЕсли ПорядокОтраженияРасходов = ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Затраты") Тогда
		СтруктураПараметров = ПодготовитьСтруктуруПараметровПолученияСпособаУчетаНДС();
		СпособУчетаНДС 		= CW_Финансы.ПолучитьСпособУчетаНДС(СтруктураПараметров);
	КонецЕсли;           
	
	ПорядокОтраженияРасходовПриИзмененииНаСервере();
	
	_УправлениеЭлементамиФормами();
	
КонецПроцедуры
   
&НаСервере
Процедура ПорядокОтраженияРасходовПриИзмененииНаСервере()
	
	Если Не ЗначениеЗаполнено(Договор) Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьОграниченияНоменклатуры = ПолучитьНаличиеОграниченийПоНоменклатуре();
	
	СтруктураДанных = новый Структура;
	СтруктураДанных.Вставить("АдресУслугПоДоговору"			, АдресУслугПоДоговору);
	СтруктураДанных.Вставить("ЭлементФормы"					, Элементы.Номенклатура);
	СтруктураДанных.Вставить("ЕстьОграниченияПоСпискуУслуг"	, ЕстьОграниченияНоменклатуры);
	
	_УФС.УстановитьСписокУслуг(СтруктураДанных);
	
КонецПроцедуры


&НаКлиенте
Функция ПодготовитьСтруктуруПараметровПолученияСпособаУчетаНДС()
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Дата"					, ТекущаяДата());
	СтруктураПараметров.Вставить("Организация"			, Организация);
	СтруктураПараметров.Вставить("Номенклатура"			, Номенклатура);
	СтруктураПараметров.Вставить("НоменклатурнаяГруппа"	, ПолучитьНоменклатурнуюГруппу(Номенклатура));
	
	Возврат СтруктураПараметров;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьНоменклатурнуюГруппу(Номенклатура)
	
	Возврат  Номенклатура.НоменклатурнаяГруппа;
	
КонецФункции

&НаКлиенте
Процедура ПорядокОтраженияДоходовПриИзменении(Элемент)
	
	Если ПорядокОтраженияДоходов.Пустая() Тогда
		
		ПорядокОтраженияДоходов = ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.СобственнаяУслуга");
		
	КонецЕсли;  
	
	ПорядокОтраженияДоходовПриИзмененииНаСервере();
	
КонецПроцедуры    


&НаСервере
Процедура ПорядокОтраженияДоходовПриИзмененииНаСервере()
	
	Если Не ЗначениеЗаполнено(Договор) Тогда
		Возврат;
	КонецЕсли;

	ЕстьОграниченияНоменклатуры = ПолучитьНаличиеОграниченийПоНоменклатуре();
	
	СтруктураДанных = новый Структура;
	СтруктураДанных.Вставить("АдресУслугПоДоговору"			, АдресУслугПоДоговору);
	СтруктураДанных.Вставить("ЭлементФормы"					, Элементы.Номенклатура);
	СтруктураДанных.Вставить("ЕстьОграниченияПоСпискуУслуг"	, ЕстьОграниченияНоменклатуры);
	
	_УФС.УстановитьСписокУслуг(СтруктураДанных);
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	
	Если (Количество <= 0 ) Тогда
		
		Количество=1;
		
	КонецЕсли; 
	
	ЗаполнитьПараметрыФормулы();
	
КонецПроцедуры

// --- 

&НаКлиенте
Процедура РаспределитьКоличествоПророрциональноПараметруПриИзменении(Элемент)
	
	Если (РаспределитьКоличествоПророрциональноПараметру) Тогда
		РазделитьКоличествоУслугНаКоличествоГрузоперевозок = Ложь;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура РазделитьКоличествоУслугНаКоличествоГрузоперевозокПриИзменении(Элемент)
	
	Если (РазделитьКоличествоУслугНаКоличествоГрузоперевозок) Тогда
		РаспределитьКоличествоПророрциональноПараметру = Ложь;
	КонецЕсли; 
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ОпределениеВыручкиПриИзменении(Элемент)
	
	_УправлениеЭлементамиФормами();
	
КонецПроцедуры
 
&НаКлиенте
Процедура НоменклатураАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)

	Если Не ПустаяСтрока(Текст) и ЭтоАдресВременногоХранилища(АдресУслугПоДоговору) Тогда
		ИспользуетсяОгранчиениеУслуг = ПолучитьНаличиеОграниченийПоНоменклатуре();
		Элемент.РежимВыбораИзСписка  = ИспользуетсяОгранчиениеУслуг;	
		Если ИспользуетсяОгранчиениеУслуг Тогда 
			Если Элемент.СписокВыбора.Количество()> 0 Тогда
				Элемент.СписокВыбора.Очистить();
			КонецЕсли;
			
			Элемент.СписокВыбора.ЗагрузитьЗначения(_УФС.ПолучитьУслугиДоговора(АдресУслугПоДоговору));   
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры    

&НаСервере
Функция ПолучитьНаличиеОграниченийПоНоменклатуре()
	
	ЕстьОграниченияНоменклатуры = ЕстьОграниченияНоменклатурыПоДоговору;
	Если ЕстьОграниченияНоменклатуры и НеОграничиватьУслугиПоПеревыставлению Тогда
		Если ТипДокумента = "CW_РасходыПоГрузоперевозке" Тогда
			ЕстьОграниченияНоменклатуры = ПорядокОтраженияРасходов <> ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Перевыставление");
		ИначеЕсли ТипДокумента = "CW_ДоходыПоГрузоперевозке" Тогда
			ЕстьОграниченияНоменклатуры = ПорядокОтраженияДоходов <> ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.Перевыставление");
		КонецЕсли; 
	КонецЕсли;
	
	Возврат ЕстьОграниченияНоменклатуры;
	
КонецФункции


&НаКлиенте
Процедура ПолучитьКоличествоИзПараметраГрузоперевозкиПриИзменении(Элемент)
	
	_УправлениеЭлементамиФормами();
	ЗаполнитьПараметрыФормулы();
	
КонецПроцедуры
